src/main/java/ru/vk/itmo/test/kovalevigor/reports/html/stage1/get_n_11000_wrk.txt
Running 10s test @ http://localhost:8080
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms  772.55us   9.82ms   71.01%
    Req/Sec        nan       nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.55ms
 90.000%    2.07ms
 99.000%    3.15ms
 99.900%    8.30ms
 99.990%    9.77ms
 99.999%    9.82ms
100.000%    9.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.025     0.000000            1         1.00
       0.259     0.100000        11009         1.11
       0.459     0.200000        22039         1.25
       0.651     0.300000        33024         1.43
       0.835     0.400000        44063         1.67
       1.010     0.500000        55028         2.00
       1.091     0.550000        60511         2.22
       1.162     0.600000        66066         2.50
       1.267     0.650000        71516         2.86
       1.399     0.700000        76993         3.33
       1.547     0.750000        82503         4.00
       1.625     0.775000        85269         4.44
       1.707     0.800000        88010         5.00
       1.796     0.825000        90753         5.71
       1.890     0.850000        93504         6.67
       1.980     0.875000        96252         8.00
       2.026     0.887500        97636         8.89
       2.073     0.900000        99034        10.00
       2.119     0.912500       100397        11.43
       2.165     0.925000       101760        13.33
       2.215     0.937500       103162        16.00
       2.239     0.943750       103819        17.78
       2.267     0.950000       104510        20.00
       2.317     0.956250       105189        22.86
       2.383     0.962500       105874        26.67
       2.467     0.968750       106554        32.00
       2.515     0.971875       106899        35.56
       2.569     0.975000       107244        40.00
       2.627     0.978125       107592        45.71
       2.707     0.981250       107933        53.33
       2.813     0.984375       108269        64.00
       2.881     0.985938       108442        71.11
       2.979     0.987500       108613        80.00
       3.077     0.989062       108785        91.43
       3.201     0.990625       108958       106.67
       3.331     0.992188       109130       128.00
       3.475     0.992969       109214       142.22
       3.641     0.993750       109300       160.00
       3.815     0.994531       109386       182.86
       4.027     0.995313       109472       213.33
       4.387     0.996094       109559       256.00
       4.619     0.996484       109602       284.44
       4.867     0.996875       109644       320.00
       5.179     0.997266       109687       365.71
       5.675     0.997656       109730       426.67
       6.583     0.998047       109774       512.00
       6.803     0.998242       109795       568.89
       7.155     0.998437       109816       640.00
       7.587     0.998633       109837       731.43
       8.039     0.998828       109860       853.33
       8.407     0.999023       109880      1024.00
       8.655     0.999121       109891      1137.78
       8.887     0.999219       109902      1280.00
       9.079     0.999316       109913      1462.86
       9.303     0.999414       109923      1706.67
       9.463     0.999512       109934      2048.00
       9.503     0.999561       109939      2275.56
       9.607     0.999609       109945      2560.00
       9.663     0.999658       109953      2925.71
       9.671     0.999707       109955      3413.33
       9.687     0.999756       109963      4096.00
       9.687     0.999780       109963      4551.11
       9.727     0.999805       109966      5120.00
       9.751     0.999829       109969      5851.43
       9.759     0.999854       109973      6826.67
       9.767     0.999878       109974      8192.00
       9.775     0.999890       109976      9102.22
       9.783     0.999902       109978     10240.00
       9.783     0.999915       109978     11702.86
       9.791     0.999927       109979     13653.33
       9.799     0.999939       109981     16384.00
       9.799     0.999945       109981     18204.44
       9.807     0.999951       109983     20480.00
       9.807     0.999957       109983     23405.71
       9.807     0.999963       109983     27306.67
       9.815     0.999969       109985     32768.00
       9.815     0.999973       109985     36408.89
       9.815     0.999976       109985     40960.00
       9.815     0.999979       109985     46811.43
       9.815     0.999982       109985     54613.33
       9.823     0.999985       109987     65536.00
       9.823     1.000000       109987          inf
#[Mean    =        1.112, StdDeviation   =        0.773]
#[Max     =        9.816, Total count    =       109987]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  109988 requests in 10.00s, 25.87MB read
  Non-2xx or 3xx responses: 29526
Requests/sec:  10999.11
Transfer/sec:      2.59MB